---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShape.ShapeFamilyId
source: html/60b519a8-b0cd-f078-559b-d35b7ab88b1c.htm
---
# Autodesk.Revit.DB.Structure.RebarShape.ShapeFamilyId Property

Get and return the rebar shape family id.

## Syntax (C#)
```csharp
public ElementId ShapeFamilyId { get; }
```